config/cf/Catalogs/УдаленноеУправление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УдаленноеУправление</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КонтактныеЛица</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Подразделения</xr:Item>
				<xr:Item>Catalog.Пользователи</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецУдаленногоУправления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСтрока1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСтрока2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСтрока3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСтрока4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеСтрока5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеБулево1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеБулево2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеБулево3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ТипыПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ТипыПодключений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AeroAdmin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AmmyAdmin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AnyDesk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DameWareMiniRemoteControl</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LiteManager</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RAdmin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RDP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RemoteManipulatorSystem</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TeamViewer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>UltraVNC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяКоманда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/УдаленноеУправление/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		ТипПодключенияПриИзменении(Неопределено);
		Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			ОбъектПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьИтоговуюСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_УдаленноеУправление");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
    УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	ОбъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПодключенияПриИзменении(Элемент)
	
	Если Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.AnyDesk") Тогда
		Объект.ПараметрыЗапуска = "";
		Объект.Порт = 7070;
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.LiteManager") Тогда
		Объект.ПараметрыЗапуска = "/FULLCONTROL";
		Объект.Порт = 5650;
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.RAdmin") Тогда
		Объект.ПараметрыЗапуска = "";
		Объект.Порт = 4899;
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.DameWareMiniRemoteControl") Тогда
		Объект.ПараметрыЗапуска = "";
		Объект.Порт = 6129;
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.UltraVNC") Тогда
		Объект.ПараметрыЗапуска = "-connect";
		Объект.Порт = 5900;
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.RemoteManipulatorSystem") Тогда
		Объект.ПараметрыЗапуска = "/fullcontrol";
		Объект.ПолеБулево1 = Ложь;
		Объект.Порт = 5650;
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.AeroAdmin") Тогда
		Объект.ПараметрыЗапуска = "";
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.RDP") Тогда
		Объект.Порт = 3389;
		Объект.ПараметрыЗапуска = "";
	ИначеЕсли Объект.ТипПодключения = ПредопределенноеЗначение("Перечисление.ТипыПодключений.AmmyAdmin") Тогда
		Объект.ПараметрыЗапуска = "";
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	ОбновитьИтоговуюСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	
	ОбновитьИтоговуюСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапускаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ШаблоныПараметровЗапускаУдаленногоУправления.ФормаВыбора",,,,, 
		,Новый ОписаниеОповещения("ПараметрыЗапускаНачалоВыбораЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыЗапускаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено 
		И ТипЗнч(Результат) = Тип("СправочникСсылка.ШаблоныПараметровЗапускаУдаленногоУправления") Тогда
		
		Объект.ПараметрыЗапуска = ПолучитьТекстШаблона(Результат);
		ОбновитьИтоговуюСтрокуЗапуска();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запустить(Команда)
	
	Настройка = Новый Структура();
	Настройка.Вставить("Объект", Объект);
	
	ПараметрыЗапуска    = Новый Структура;
	ОписаниеОповоещения = Новый ОписаниеОповещения("ВыполнитьПослеЗапуска", ЭтотОбъект, ПараметрыЗапуска);
	УдаленноеУправлениеКлиент.ЗапуститьУдаленноеУправление(ОписаниеОповоещения, Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗапуска(П1, П2) Экспорт
	
	// ТУТ НИЧЕГО.
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипПодключения) Тогда
		
		Элементы.Страницы.Видимость = Ложь;
		Элементы.ФормаЗапустить.Картинка = Неопределено;
		
	Иначе
		
		Элементы.Страницы.Видимость = Истина;
		ТекущаяСтраница = ПредставлениеПеречисления(Объект.ТипПодключения);
		Элементы.Страницы.ТекущаяСтраница = Элементы[ТекущаяСтраница];
		Элементы.ФормаЗапустить.Картинка = БиблиотекаКартинок[ТекущаяСтраница];
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеПеречисления(Знач ТипПеречисления)
	
	Возврат Метаданные.Перечисления.ТипыПодключений.ЗначенияПеречисления.Получить(
		Перечисления.ТипыПодключений.Индекс(ТипПеречисления)).Имя;
	
КонецФункции

&НаСервере
Процедура ОбъектПриИзмененииНаСервере()
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Строка(Объект.Владелец);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоговуюСтрокуЗапуска()
	
	Настройка = Новый Структура("ТипПодключения,АдресПодключения,Логин,Пароль,ПараметрыЗапуска,Порт");
	ЗаполнитьЗначенияСвойств(Настройка, Объект);
	Настройка.Вставить("Объект", Объект);
	Настройка.Вставить("СкрыватьПароль", Истина);
	
	ИтоговаяСтрокаЗапуска = УдаленноеУправлениеКлиент.ИтоговаяСтрокаЗапуска(Настройка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстШаблона(Знач ШаблонСсылка)
	
	Возврат ?(ЗначениеЗаполнено(ШаблонСсылка), ШаблонСсылка.ТекстШаблона, "");
	
КонецФункции

#КонецОбласти
